{
    "AABB" : {
        "body" : {
            "0" : [
                "<b>Список методов AABB</b>\n\nВозвращает объект <code>AABB</code>:\n<blockquote expandable><code>AABB abs()</code> Вернет эквивалентный огранич. прямоугольнику, с неорицательными изменёнными значениями ширины, высоты и глубины.\n<code>expand(to_point: Vector3)</code> Вернет копию огранич. рамки, расширенную для до to_point.\n<code>grow(by: float)</code> Вернет копию огранич. рамки, увеличенную со всех сторон на заданное значение. Отрицательное значение уменьшает рамку.\n<code>intersection(with: AABB)</code> Вернет пересечение между огранич. прямоугольником с with. Если они не пересекаются - вернет пустой AABB. Если прямоугольники пересекаются по краю - вернет плоский AABB без объёма.\n<code>merge(with: AABB)</code> Возвращает AABB, который охватывает как этот огранич. прямоугольник, так и его края.</blockquote>",
                "\n\nВозвращает значение <code>bool</code>:\n<blockquote expandable><code>encloses(with: AABB)</code> Вернет true, если эта огранич. рамка полностью охватывает объект.\n<code>has_point(point: Vector3)</code> Вернет true, если огранич. рамка содержит заданную точку. По соглашению, точки, расположенные точно справа, сверху и спереди, не учитываются.\n<code>has_surface()</code> Вернет true, если у огранич. рамки есть хотя бы один компонент размера больше 0.\n<code>has_volume()</code> Вернет true, если ширина, высота и глубина ограничивающей рамки положительны.\n<code>intersects(with: AABB)</code> Вернет true, если эта огранич. рамка пересекается с рамкой with. Края обеих рамок исключаются.\n<code>intersects_plane(plane: Plane)</code> Вернет true, если огранич. рамка находится по обе стороны от заданной plane.\n<code>is_equal_approx(aabb: AABB)</code> Вернет true, если эта огранич. рамка и aabb приблизительно равны, вызывая функцию Vector3.is_equal_approx для позиции и размера.\n<code>is_finite()</code> Вернет значение true, если значения этого огранич. прямоугольника конечны, вызывая Vector3.is_finite для определения положения и размера.</blockquote>",
                "\n\nВозвращает значение <code>Vector3</code>:\n<blockquote expandable><code>get_center()</code> Вернет центр огранич. рамки. Аналог: position  + (size / 2.0).\n<code>get_endpoint(idx: int)</code> Вернет положение 1 из 8 вершин, составляющих огранич. прямоугольник. При idx 0 вернет position, при idx 7 — конец.\n<code>get_longest_axis()</code> Вернет самую длинную нормализованную ось огранич. прямоугольника в виде вектора Vector3 (Vector3.RIGHT, Vector3.UP или Vector3.BACK).\n<code>get_shortest_axis()</code> Вернет кратчайшую нормализованную ось в виде вектора.\n<code>get_support(direction: Vector3)</code> Вернет положение вершины огранич. рамки (опорную точку), находящайся дальше всего в заданном направлении.</blockquote>",
                "\n\nВозвращает значение <code>int</code>:\n<blockquote expandable><code>get_longest_axis_index()</code> Вернет индекс самой длинной оси огранич. рамки (см. Vector3.AXIS_X, Vector3.AXIS_Y и Vector3.AXIS_Z).\n<code>get_longest_axis_size()</code> Вернет наибольшее измерение огранич. прямоугольника.\n<code>get_shortest_axis_index()</code> Вернет индекс кратчайшей оси огранич. рамки.</blockquote>",
                "\n\nВозвращает значение <code>float</code>:\n<blockquote expandable><code>get_shortest_axis_size()</code> Вернет кратчайшее измерение размера огранич. рамки.\n<code>get_volume()</code> Вернет объём огранич. рамки. Аналог: size.x * size.y * size.z.</blockquote>",
                "\n\nВозвращает значение <code>Variant</code>:\n<blockquote expandable><code>intersects_ray(from: Vector3, dir: Vector3)</code> Вернет первую точку пересечения огранич. рамки и заданного луча в виде Vector3. Если пересечения нет - вернет null. Луч начинается в from, направлен в сторону dir и простирается до бесконечности.\n<code>intersects_segment(from: Vector3, to: Vector3)</code> Вернет первую точку пересечения ограничивающей рамки и заданного отрезка в виде Vector3. Если пересечения нет - вернет null. Отрезок начинается в точке from и заканчивается в точке to.</blockquote>"
            ]
        },
        "button" : {
            "text" : "См. в документации:",
            "link" : "https://docs.godotengine.org/en/stable/classes/class_aabb.html"
        }
    },
    "ARRAY" : {
        "body" : {
            "0" : [
                "<b>Список методов Array</b>\n\nВозвращает объект <code>Array</code>:\n<blockquote expandable><code>duplicate(deep: bool = false)</code> Вернет новую копию массива. Если deep = false, изменения значений в одном массиве повлияет и на другой.\n<code>filter(method: Callable)</code> Вызывает Callable для каждого элемента массива и возвращает новый отфильтрованный массив.\n<code>map(method: Callable)</code> Вызывает Callable для каждого элемента массива и возвращает новый массив, заполненный значениями, возвращёнными методом.\n<code>slice(begin: int, end: int = 2147483647, step: int = 1, deep: bool = false)</code> Вернет новый массив, содержащий элементы этого массива от индекса begin (включительно) до индекса end (исключительно), с шагом в step.</blockquote>",
                "\n\nВозвращает значение <code>bool</code>:\n<blockquote expandable><code>all(method: Callable)</code> Вернет Callable для каждого элемента массива и вернет true.\n<code>any(method: Callable)</code> Вернет Callable для каждого элемента массива и возвращает true, если Callable возвращает true для одного или нескольких элементов массива. Если Callable возвращает false для всех элементов массива, этот метод возвращает false.\n<code>has(value: Variant)</code> Вернет true, если массив содержит заданное value.\n<code>is_empty()</code> Вернет true, если массив пуст.\n<code>is_read_only</code> Вернет true, если массив доступен только для чтения.\n<code>is_same_typed(array: Array)</code> Вернет true, если этот массив имеет тот же тип, что и заданный array.\n<code>is_typed()</code> Вернет true, если массив является типизированным.</blockquote>",
                "\n\nВыполняет метод без возвращения значения <code>void</code>:\n<blockquote expandable><code>append(value: Variant)</code> Добавит value в конец массива.\n<code>append_array(array: Array)</code> Добавит array в конец массива.\n<code>assign(array: Array)</code> Присваивает элементам array значения из этого массива. Изменяет размер массива в соответствии с array. Преобразовывает типы, если массив типизированный.\n<code>clear()</code> Очищает массив. Эквивалент: resize с размером 0.\n<code>erase(value: Variant)</code> Находит и удаляет первое вхождение value в массив. Если value нет - ничего не происходит. remove_at - для удаления по индексу.\n<code>fill(value: Variant)</code> Присваивает заданное value всем элементам массива.</blockquote>",
                "\n\nВозвращает значение <code>int</code>:\n<blockquote expandable><code>bsearch(value: Variant, before: bool = true)</code> Вернет индекс value в отсортированном массиве. Если не найдено, возвращает место, куда следует вставить value, чтобы сохранить сортировку массива. Алгоритм бинарного поиска.\n<code>bsearch_custom(value: Variant, func: Callable, before: bool = true)</code> Аналог bsearch, но с Callable.\n<code>count(value: Variant)</code> Вернет количество вхождений элемента в массив.\n<code>find(what: Variant, from: int = 0)</code> Вернет индекс первого вхождения чего-либо в этот массив или -1, если ничего нет. Начало поиска - from, продолжая поиск до конца массива.\n<code>find_custom(method: Callable, from: int = 0)</code> Аналог find, но с Callable.\n<code>get_typed_builtin()</code> Вернет Variant для типизированного массива в виде константы Variant.Type. Если массив не типизирован - @GlobalScope.TYPE_NIL.\n<code>hash()</code> Возвращает хешированное 32-битное целое число, представляющее массив и его содержимое.\n<code>insert(position: int, value: Variant)</code> Вставляет новый элемент (value) в заданный индекс (position). Позиция должна находиться в диапазоне от 0 до размера массива.</blockquote>",
                "\n\nВозвращает значение <code>Variant</code>:\n<blockquote expandable><code>back()</code> Вернет последний элемент массива. Если массив пуст - вернет null.\n<code>front()</code> Вернет первый элемент массива. Если массив пуст, возвращается значение null.\n<code>get(index: int)</code> Вернет элемент с заданным index в массиве. Аналог (массив[index]).\n<code>get_typed_script()</code> Вернет экземпляр Script, связанный с этим типизированным массивом, или значение null, если он не существует.</blockquote>"
            ],
            "1" : [
                "<b>Продолжение методов Array</b>\n\nВыполняет метод без возвращения значения <code>void</code>:\n<blockquote expandable><code>push_back(value: Variant)</code> Добавляет value в конец массива.\n<code>push_front(value: Variant)</code> Добавляет value в начало массива.\n<code>remove_at(position: int)</code> Удаляет элемент из массива по заданному индексу position.\n<code>reverse()</code> Меняет порядок всех элементов в массиве.\n<code>set(index: int, value: Variant)</code> Устанавливает значение элемента с заданным index равным заданному value.\n<code>shuffle()</code> Переставляет все элементы массива в случайном порядке.\n<code>sort()</code> Сортирует массив в порядке возрастания. Окончательный порядок зависит от сравнения элементов по принципу 'меньше чем'.\n<code>sort_custom(func: Callable)</code> Сортирует массив с помощью Callable.\n<code>make_read_only()</code> Массив доступен только для чтения.</blockquote>",
                "\n\nВозвращает значение <code>int</code>:\n<blockquote expandable><code>resize(size: int)</code> Устанавливает количество элементов в массиве равным size.\n<code>rfind(what: Variant, from: int = -1)</code> Вернет индекс последнего вхождения what в этот массив или -1, если его нет.\n<code>rfind_custom(method: Callable, from: int = -1)</code> Вернет индекс последнего элемента массива, при котором Callable возвращает true, или -1, если таких элементов нет.\n<code>size()</code> Вернет количество элементов в массиве.</blockquote>",
                "\n\nВозвращает значение <code>Variant</code>:\n<blockquote expandable><code>max()</code> Вернет максимальное значение, содержащееся в массиве, если все элементы можно сравнить. Иначе - null.\n<code>min()</code> Аналог max(), но наоборот.\n<code>pick_random()</code> Вернет случайный элемент из массива.\n<code>pop_at(position: int)</code> Удаляет и возвращает элемент массива по индексу position. Если индекс -1, он считается относительно конца массива.\n<code>pop_back()</code> Удаляет и возвращает последний элемент массива.\n<code>pop_front()</code> Удаляет и возвращает первый элемент массива.\n<code>reduce(method: Callable, accum: Variant = null)</code> Вызывает Callable для каждого элемента массива, накапливает и возвращает результат accum.</blockquote>",
                "\n\nВозвращает значение <code>StringName</code>:\n<blockquote expandable><code>get_typed_class_name()</code> Вернет имя класса типизированного массива, если значение типа Variant равно @GlobalScope.TYPE_OBJECT. В противном случае возвращает пустое StringName.</blockquote>"
            ]
        },
        "button" : {
            "text" : "См. в документации:",
            "link" : "https://docs.godotengine.org/ru/4.x/classes/class_array.html#methods"
        }
    }
}