{
    "VAR" : [
        "<b>Variant</b>\n",
        "\nВариант — это наиболее важный тип данных в Godot. Variant занимает всего 24 байта на 64-битных платформах (20 байт на 32-битных платформах) и может хранить в себе практически любой тип данных движка. Варианты редко используются для хранения информации в течение длительного времени, вместо этого они применяются в основном для передачи, редактирования, сериализации и перемещения данных",
        "\n<blockquote expandable>В компьютерном программировании класс Variant — это класс, предназначенный для хранения данных различных типов. Динамические языки программирования, такие как PHP, Lua, JavaScript и GDScript, используют их для хранения данных переменных на сервере. С помощью этих вариантов свойства могут свободно менять типы значений.</blockquote>",
        "\n<pre><code class='language-GDScript'>var foo = 2 # foo - это динамическое целое число\nfoo = 'Now foo is a string!'\nfoo = RefCounter.new() # теперь foo - это объект\nvar bar: int = 2 # bar — это целое число со статической типизацией.\n# bar = 'Ой-ой-ой! Я не могу заставить статически типизированные переменные стать другого типа!'</code></pre>",
        "\nGodot отслеживает все переменные API скриптов в рамках Variants. Вы даже не осознаёте, что постоянно используете Variants. Когда конкретный язык применяет собственные правила для типизации данных, он использует собственную логику поверх базового API скриптов Variants.",
        "\n<blockquote expandable>GDScript автоматически преобразует значения в них. По умолчанию все данные хранятся в виде простых вариантов, а затем, при необходимости, применяются пользовательские правила статического типизации для типов переменных.</blockquote>",
        "\n\nГлобальная функция <code>GlobalScope.typeof</code> возвращает перечисляемое значение типа Variant, хранящееся в текущей переменной (см. типы переменных).",
        "\n<pre><code class='language-GDScript'>var foo = 2\nmatch typeof(foo):\n   TYPE_NIL: print('foo является нуль')\nTYPE_INT: print('foo - целое число)\nTYPE_OBJECT:\n   #Обратите внимание, что объекты представляют собой отдельную категорию.\n   #Чтобы получить имя базового типа объекта, вам понадобится метод `get_class()`\n   print('foo is a(n) %s' % foo.get_class())</code></pre>",
        "\n\nПодробнее: https://docs.godotengine.org/en/stable/classes/class_variant.html"
    ],
    "AABB" : [
        "<b>Список свойств AABB:</b>\n",
        "\n<code>end = Vector3(0,0,0)</code> Конечная точка. Обычно это угол в правом верхнем углу огранич. рамки, эквивалентентный position + size. Влияет на размер.",
        "\n<code>position = Vector3(0,0,0)</code> Точка начала координат. Обычно это левый нижний угол ограничительной рамки.",
        "\n<code>size = Vector3(0, 0, 0)</code> Ширина, высота и глубина огранич. рамки, начиная с позиции. Влияет на конечную точку.",
        "\n\nПодробнее: https://docs.godotengine.org/en/stable/classes/class_aabb.html"
    ]
}