{
    "0": {
        "title" : "Фишки Godot",
        "author" : "@godottools",
        "tags" : ["ALL", "ВСЕ"],
        "body" : {
            "0" : [
                "<b>Список всех доступных курсов:</b>\n\n<blockquote expandable>GDScript. Введение в скрипт. От @anatoly3yb</blockquote>"
            ]
        }
    },
    "1": {
        "title" : "GDScript. Введение в скрипт",
        "author" : "@anatoly3yb",
        "tags" : ["GDSCRIPT", "ГДСКРИПТ"],
        "body" : {
            "0" : [
                "<b>GDScript. Введение в скрипт</b>",
                "\n\nДобро пожаловать на курс по <code>Godot Script</code>. В этом курсе:",
                "\n<blockquote expandable>1. Кратко затроним тему языков программирования и их работы;\n2. Кратко затроним тему базы <code>Godot Script</code>;\n3. Научимся писать код на примерах.</blockquote>",
                "\n\n<b>Примечание:</b> данный курс создан для полный новичков",
                "\n\n<b>0</b> • 1 • 2"
            ],
            "1" : [
                "<b>GDScript. Введение в скрипт</b>",
                "\n\nГЛАВА 1 - Суть и устройство языков программирования",
                "\n\nЯзык программирования - это набор инструкций, который компьютер может понимать и выполнять. Это нужно для того, чтобы автоматизировать какие-либо процессы, создавать приложения/игры, или же управлять чем-либо.\nСуть программирования заключается в обработке данных.\n\nПодробнее о данных:",
                "\n<blockquote expandable>Данные в программировании следует разделять на их типы, следовательно существуют следующие типы данных:\n\n• int (integer) - тип данных, содержащих только цельные числа, такие как 0, 5, 23, 104 и тд. В него невозможно записать десятичное значение, и оно будет округлено до целого числаю.\n• float - число с плавающей точкой (десятичное число), тип данных, содержащие дробные значения, например: 1.53, 5.5, 109,09 и т.д.\n• bool (boolean) - логическая истина или ложь. Этот тип данных используется для создания условий, или их проверки. Мы рассмотрим примеры дальше.\n• String (буквенные литералы) - тип данных, содержащие в себе структуру символов, например слова, предложения или даже абзацы.</blockquote>",
                "\n\n<b>Примечания: </b> Типов данных может быть и больше. Сверху приведены самые часто используемые, и существующие в большинстве языков программирования, типы данных.",
                "\nТеперь мы знаем, что такое языки программирования, зачем они нужны, и как они хранят информацию.",
                "\n\n0 • <b>1</b> • 2"
            ],
            "2" : [
                "<b>GDScript. Введение в скрипт</b>",
                "\n\nГЛАВА 2 - Как язык программирования работает с данными",
                "\n\nМы знаем, что в программировании существуют типы данных. Теперь изучим, как мы можем хранить данные в них.\n\nПример кода:",
                "\n<pre><code class='language-GDScript'>var numFriends = 5\nvar numData = 17.15\nvar answer = 'Go'\nvar isRain = false\n\nfunc _ready():\n   if numData >= 17.15 and isRain == false:\n      print(answer + 'walking outside with ' + str(numFriends) + 'friends')</code></pre>",
                "\n\nРазберемся в коде построчно, сверху вниз:",
                "\n<blockquote expandable>Чтобы хранить данные и обращаться к ним, нам нужно создавать переменные. Переменная состоит из ключевого слова ее объявления <code>var</code>, затем идет название переменной и через оператор <code>=</code> присваивается значение\nВ нашем случае, мы создали 4 переменные на 4 строчках, дали им названия и значения, состоящих из типов данных.\n<b>Важное примечание:</b> Godot сам определит типы данных в этих переменных, и зачастую можно создавать их, не указывая тип, но в последствии мы уначимся это желать, улучшая производительность игры.\n\nДалее идет функция <code>_ready()</code> - данная функция создается и вызывается Godot при запуске уровня (в нашем случае игры)\n\nСуть этой программы в том, чтобы позвать гулять друзей после 17:15, но преварительно убедившись что нету дожня. Это называется условием, и для его решения существет цикл <code>if</code>\nПосле ключевого слова <code>if</code> мы прописываем условие: наше время (numData) должно быть больше или равно 17.15, и логическое значение дождя (isRain) должно быть равно <code>false</code> (ложью)\nЕсли условия были удовлетворены, код снизу сработает, в ином случае оно пропустит эту строчку.\nТак как мы заранее задали нужные переменные, наша строчка выведет в консоль следующий текст: 'Go walking outside with 5 friends'</blockquote>",
                "\n\n0 • 1 • <b>2</b>"
            ]
        },
        "pages" : "2"
    }
}